alert("Вы попали в древнее подземелье, что-бы выбраться вам необходимо одолеть древнего босса")
alert("У вас есть лишь знание о правой части подземелья,")
alert("Там есть комната испытания и древний хранитель")
alert("От комнаты испытания можно попасть в центральное святилище")
alert("Есть и проход в другую сторону ходили слухи что там библиотека и закалдованная комната")
alert("В прочем выбора у вас особого нет, поэтому надо отправлятся в путь")

const inventory = [];
let room = "вход";

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

while (true) {
    if (room === "вход") {
        alert("Куда вы отправитесь сейчас?")
        const choice = prompt(
            "ВЫ У ВХОДА\n" +
            "1 — Длинный коридор\n" +
            "2 — Неизвестная комната\n" +
            "3 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Длинный коридор";
        } else if (choice === "2") {
            room = "Неизвестная комната"
        } else if (choice === "3") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Длинный коридор") {
        alert("Вы проходите в длинный коридор, на стенах горят мелкие факела")
        alert("У стены вы видете скелет")
        let a = confirm("Вы хотите его обыскать?")
        if (a = true) {
            alert("Вы начали обыскивать старый труп")
            alert("Вы ничего не нашли")
        }
        else{
            alert("Вы решили не обыскивать труп")
        }
        alert("Спереди виднеется очень яркий свет")
        alert("Вы наполняетесь решимостью")
        alert("Вы вспоминаете что был другой проход,что вы выберете")
        alert("Куда же вы отправитесь дальше?")
        const choice = prompt(
            "Длинный коридор\n" +
            "1 — Пройти в комнату испытаний\n" +
            "2 — Вернуться ко входу\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Комната испытаний";
        } else if (choice === "2") {
            room = "вход";
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Комната испытаний ") {
        alert("Вы заходите в комнату извергающую ярким светом")
        alert("Свет немного протих,и из под центрального янтаря появляется табличка")
        alert("Те кто пройдет мое испытание попадет в ГЛАВНОЕ СВЯТИЛИЩЕ")
        alert("Прочитав эту надпись вы наполняетесь решимостью")
        alert("Вдали комнаты из стены торчит камень, похожий на некий механизм")
        alert("Что же вы решите делать, пройти испытание или же посмотреть механизм?")
        const choice = prompt(
            "Комната испытаний\n" +
            "1 — Подойти к механизму\n" +
            "2 — Главное святилище\n" +
            "3 - Пройти испытание\n" +
            "4 - Вернуться на вход\n" +
            "0 — Завершить игру\n"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Подойти к механизму";
        } else if (choice === "2") {
            inventory.forEach(el => {
                if (el === "ключ") {
                    room = "Главное святилище";
                }
                else {
                    alert("Вы еще не прошли испытание")
                }
            });
        } else if (choice === "3") {
            room = "Пройти испытание";
        } else if (choice === "4") {
            room = "Вход";
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Подойти к механизму") {
        alert("Вы подходите к странному камню который торчит из стены")
        alert("Вы решаетесь выдвинуть его из стены")
        alert("Из обычной стены резко появляется дверь")
        alert("Вы попадаете в комнату хранителя") 
        const choice = prompt(
            "Странный механизм\n" +
            "1 — Комната хранителя\n" +
            "2 — Отойти назад\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Комната хранителя";
        } else if (choice === "2") {
            room = "Назад";
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Комната хранителя") {
        alert("Вы заходите комнату ")
        alert("")
        alert("")
        const choice = prompt(
            "Комната хранителя\n" +
            "1 — Подойти к хранителю\n" +
            "2 — осмотреться \n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "";
        } else if (choice === "2") {
            room = "";
        } else {
            alert("Такого прохода нет.");
        }
    }











    else if (room === "Неизвестная комната") {
        alert("Вы заходите в неизвестную комнату")
        alert("В комнате темно, на полу вы видете янтарный амулет")
        alert("Вы его подбераете")
        inventory.push("янтарный амулет");
        alert("В ваших руках амулет освещает комнату, на полу лежит ковер, в углу комнату стоит стол")
        alert("По всюду разбросаны монеты и камни")
        alert("На столе вы замечаете записку, в ней написано:")
        alert("Следуйщая комната - Заколдованна. Что-бы ее пройти нужен защитный амулет,без него вы обречены на верную смерть, как я.После этой комнаты идет таинсвенный перевал,ходят легенды что там есть портал в особые владения легендарного босса")
        alert("Возможно защитный амулет можно получить у хранителя")

        const choice = prompt(
            "Неизвестная комната\n" +
            "1 — Вернуться ко входу\n" +
            "2 — пройти дальше\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "";
        } else if (choice === "2") {
            room = "вход";
        } else {
            alert("Такого прохода нет.");
        }
    }


















}
